---
kind: method
id: M:Autodesk.Revit.DB.RadialArray.IsValidArraySize(System.Int32)
source: html/8ff3a73a-a9ad-b793-b05b-37d0b1a601bc.htm
---
# Autodesk.Revit.DB.RadialArray.IsValidArraySize Method

This indicates whether the input count is valid.

## Syntax (C#)
```csharp
public static bool IsValidArraySize(
	int count
)
```

## Parameters
- **count** (`System.Int32`) - The count.

## Returns
True if the input count is between 3 and 200, false otherwise.